//-------------------------------1-----------------------------------
        // async function wait() {
        //     await new Promise(resolve => setTimeout(resolve, 1000));

        //     return 10;
        // }
        
        // function f() {
        //     wait().then(result => console.log(result));
        // };

        // f();
//-------------------------------1-----------------------------------



//-------------------------------2-----------------------------------

    // promise.then(f1, f2) - в этом случае нету продолжения цепочки, 
    // и как бы ошибка будет невидима

//-------------------------------2-----------------------------------
